src/main/resources/webServiceRequestXmls/APITransactions.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:elt="http://eltws.map.ecs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <elt:callExtAPITransactions>
         <!--Optional:-->
         <extAPITxnRequest>
            <!--Optional:-->
            <userId>772273</userId>
            <!--Optional:-->
            <sessionKey>316X13U7DXXJRSWUZ4AIUVO</sessionKey>
            <!--Optional:-->
            <channel>31</channel>
            <!--Optional:-->
            <passCodeFlag>N</passCodeFlag>
            <!--Optional:-->
            <passCode></passCode>
            <!--Optional:-->
            <emvData></emvData>
            <!--Optional:-->
            <formFactorType>CRD</formFactorType>
            <!--Optional:-->
            <formFactorExpiryDate>2012</formFactorExpiryDate>
            <!--Optional:-->
            <transactionCounter>10</transactionCounter>
            <!--Optional:-->
            <transactionType>O</transactionType>
            <!--Optional:-->
            <rrn>755203881178</rrn>
            <!--Optional:-->
            <transactionCode>IL</transactionCode>
            <!--Optional:-->
            <transactionDateTime>20170726120000</transactionDateTime>
            <!--Optional:-->
            <txnCurrency>144</txnCurrency>
            <!--Optional:-->
            <txnamount>10</txnamount>
            <!--Optional:-->
            <currencyConversionRate></currencyConversionRate>
            <!--Optional:-->
            <mcc>5999</mcc>
            <!--Optional:-->
            <acceptorTerminalId></acceptorTerminalId>
            <!--Optional:-->
            <acceptorMerchantId></acceptorMerchantId>
            <!--Optional:-->
            <acceptorNameLocation></acceptorNameLocation>
            <!--Optional:-->
            <remarks>test</remarks>
            <!--Optional:-->
            <formFactor>5566772220000011</formFactor>
            <!--Optional:-->
            <pinBlock></pinBlock>
            <!--Optional:-->
            <newPinBlock></newPinBlock>
            <!--Optional:-->
            <fromPAN></fromPAN>
            <!--Optional:-->
            <toPAN></toPAN>
            <!--Optional:-->
            <traceAuditNumber>123456</traceAuditNumber>
            <!--Optional:-->
            <billingAmt>10</billingAmt>
            <!--Optional:-->
            <billingCurrency>144</billingCurrency>
            <!--Optional:-->
            <originalDateTimeTransmission></originalDateTimeTransmission>
            <!--Optional:-->
            <dateTimeTransmission>0724020000</dateTimeTransmission>
            <!--Optional:-->
            <originalTraceAuditNumber></originalTraceAuditNumber>
         </extAPITxnRequest>
      </elt:callExtAPITransactions>
   </soapenv:Body>
</soapenv:Envelope>